app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "salt" = '8034cd9e22611fdb7e8983fcde579f8cc94f7f42b737c7c0a972622a03960b29', "encrypted_password" = 'e7d5b6ac56ffc8c8c178baabfce8d6c6be43c5bc4530f171a4237f2f047d1fb1', "updated_at" = '2011-06-21 18:56:10.294873' WHERE "users"."id" = 1

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1